Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17175.h
extern volatile CWG1DATbits_t CWG1DATbits __at(0x60D);
// bitfield macros
#define _CWG1DAT_ISM_POSN                                   0x0
#define _CWG1DAT_ISM_POSITION                               0x0
#define _CWG1DAT_ISM_SIZE                                   0x8
#define _CWG1DAT_ISM_LENGTH                                 0x8
#define _CWG1DAT_ISM_MASK                                   0xFF
#define _CWG1DAT_CWG1ISM_POSN                               0x0
#define _CWG1DAT_CWG1ISM_POSITION                           0x0
#define _CWG1DAT_CWG1ISM_SIZE                               0x8
#define _CWG1DAT_CWG1ISM_LENGTH                             0x8
#define _CWG1DAT_CWG1ISM_MASK                               0xFF
#define _CWG1DAT_ISM0_POSN                                  0x0
#define _CWG1DAT_ISM0_POSITION                              0x0
#define _CWG1DAT_ISM0_SIZE                                  0x1
#define _CWG1DAT_ISM0_LENGTH                                0x1
#define _CWG1DAT_ISM0_MASK                                  0x1
#define _CWG1DAT_ISM1_POSN                                  0x1
#define _CWG1DAT_ISM1_POSITION                              0x1
#define _CWG1DAT_ISM1_SIZE                                  0x1
#define _CWG1DAT_ISM1_LENGTH                                0x1
#define _CWG1DAT_ISM1_MASK                                  0x2
#define _CWG1DAT_ISM2_POSN                                  0x2
#define _CWG1DAT_ISM2_POSITION                              0x2
#define _CWG1DAT_ISM2_SIZE                                  0x1
#define _CWG1DAT_ISM2_LENGTH                                0x1
#define _CWG1DAT_ISM2_MASK                                  0x4
#define _CWG1DAT_ISM3_POSN                                  0x3
#define _CWG1DAT_ISM3_POSITION                              0x3
#define _CWG1DAT_ISM3_SIZE                                  0x1
#define _CWG1DAT_ISM3_LENGTH                                0x1
#define _CWG1DAT_ISM3_MASK                                  0x8
#define _CWG1DAT_ISM4_POSN                                  0x4
#define _CWG1DAT_ISM4_POSITION                              0x4
#define _CWG1DAT_ISM4_SIZE                                  0x1
#define _CWG1DAT_ISM4_LENGTH                                0x1
#define _CWG1DAT_ISM4_MASK                                  0x10
#define _CWG1DAT_DAT_POSN                                   0x0
#define _CWG1DAT_DAT_POSITION                               0x0
#define _CWG1DAT_DAT_SIZE                                   0x8
#define _CWG1DAT_DAT_LENGTH                                 0x8
#define _CWG1DAT_DAT_MASK                                   0xFF
#define _CWG1DAT_DAT0_POSN                                  0x0
#define _CWG1DAT_DAT0_POSITION                              0x0
#define _CWG1DAT_DAT0_SIZE                                  0x1
#define _CWG1DAT_DAT0_LENGTH                                0x1
#define _CWG1DAT_DAT0_MASK                                  0x1
#define _CWG1DAT_DAT1_POSN                                  0x1
#define _CWG1DAT_DAT1_POSITION                              0x1
#define _CWG1DAT_DAT1_SIZE                                  0x1
#define _CWG1DAT_DAT1_LENGTH                                0x1
#define _CWG1DAT_DAT1_MASK                                  0x2
#define _CWG1DAT_DAT2_POSN                                  0x2
#define _CWG1DAT_DAT2_POSITION                              0x2
#define _CWG1DAT_DAT2_SIZE                                  0x1
#define _CWG1DAT_DAT2_LENGTH                                0x1
#define _CWG1DAT_DAT2_MASK                                  0x4
#define _CWG1DAT_DAT3_POSN                                  0x3
#define _CWG1DAT_DAT3_POSITION                              0x3
#define _CWG1DAT_DAT3_SIZE                                  0x1
#define _CWG1DAT_DAT3_LENGTH                                0x1
#define _CWG1DAT_DAT3_MASK                                  0x8
#define _CWG1DAT_DAT4_POSN                                  0x4
#define _CWG1DAT_DAT4_POSITION                              0x4
#define _CWG1DAT_DAT4_SIZE                                  0x1
#define _CWG1DAT_DAT4_LENGTH                                0x1
#define _CWG1DAT_DAT4_MASK                                  0x10

// Register: CWG1DBR
#define CWG1DBR CWG1DBR
extern volatile unsigned char           CWG1DBR             __at(0x60E);
#ifndef _LIB_BUILD
asm("CWG1DBR equ 060Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :8;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned CWG1DBR                :8;
    };
    struct {
        unsigned CWG1DBR0               :1;
        unsigned CWG1DBR1               :1;
        unsigned CWG1DBR2               :1;
        unsigned CWG1DBR3               :1;
        unsigned CWG1DBR4               :1;
        unsigned CWG1DBR5               :1;
    };
} CWG1DBRbits_t;
extern volatile CWG1DBRbits_t CWG1DBRbits __at(0x60E);
// bitfield macros
#define _CWG1DBR_DBR_POSN                                   0x0
#define _CWG1DBR_DBR_POSITION                               0x0
#define _CWG1DBR_DBR_SIZE                                   0x8
#define _CWG1DBR_DBR_LENGTH                                 0x8
#define _CWG1DBR_DBR_MASK                                   0xFF
#define _CWG1DBR_DBR0_POSN                                  0x0
#define _CWG1DBR_DBR0_POSITION                              0x0
#define _CWG1DBR_DBR0_SIZE                                  0x1
#define _CWG1DBR_DBR0_LENGTH                                0x1
#define _CWG1DBR_DBR0_MASK                                  0x1
#define _CWG1DBR_DBR1_POSN                                  0x1
#define _CWG1DBR_DBR1_POSITION                              0x1
#define _CWG1DBR_DBR1_SIZE                                  0x1
#define _CWG1DBR_DBR1_LENGTH                                0x1
#define _CWG1DBR_DBR1_MASK                                  0x2
#define _CWG1DBR_DBR2_POSN                                  0x2
#define _CWG1DBR_DBR2_POSITION                              0x2
#define _CWG1DBR_DBR2_SIZE                                  0x1
#define _CWG1DBR_DBR2_LENGTH                                0x1
#define _CWG1DBR_DBR2_MASK                                  0x4
#define _CWG1DBR_DBR3_POSN                                  0x3
#define _CWG1DBR_DBR3_POSITION                              0x3
#define _CWG1DBR_DBR3_SIZE                                  0x1
#define _CWG1DBR_DBR3_LENGTH                                0x1
#define _CWG1DBR_DBR3_MASK                                  0x8
#define _CWG1DBR_DBR4_POSN                                  0x4
#define _CWG1DBR_DBR4_POSITION                              0x4
#define _CWG1DBR_DBR4_SIZE                                  0x1
#define _CWG1DBR_DBR4_LENGTH                                0x1
#define _CWG1DBR_DBR4_MASK                                  0x10
#define _CWG1DBR_DBR5_POSN                                  0x5
#define _CWG1DBR_DBR5_POSITION                              0x5
#define _CWG1DBR_DBR5_SIZE                                  0x1
#define _CWG1DBR_DBR5_LENGTH                                0x1
#define _CWG1DBR_DBR5_MASK                                  0x20
#define _CWG1DBR_CWG1DBR_POSN                               0x0
#define _CWG1DBR_CWG1DBR_POSITION                           0x0
#define _CWG1DBR_CWG1DBR_SIZE                               0x8
#define _CWG1DBR_CWG1DBR_LENGTH                             0x8
#define _CWG1DBR_CWG1DBR_MASK                               0xFF
#define _CWG1DBR_CWG1DBR0_POSN                              0x0
#define _CWG1DBR_CWG1DBR0_POSITION                          0x0
#define _CWG1DBR_CWG1DBR0_SIZE                              0x1
#define _CWG1DBR_CWG1DBR0_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR0_MASK                              0x1
#define _CWG1DBR_CWG1DBR1_POSN                              0x1
#define _CWG1DBR_CWG1DBR1_POSITION                          0x1
#define _CWG1DBR_CWG1DBR1_SIZE                              0x1
#define _CWG1DBR_CWG1DBR1_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR1_MASK                              0x2
#define _CWG1DBR_CWG1DBR2_POSN                              0x2
#define _CWG1DBR_CWG1DBR2_POSITION                          0x2
#define _CWG1DBR_CWG1DBR2_SIZE                              0x1
#define _CWG1DBR_CWG1DBR2_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR2_MASK                              0x4
#define _CWG1DBR_CWG1DBR3_POSN                              0x3
#define _CWG1DBR_CWG1DBR3_POSITION                          0x3
#define _CWG1DBR_CWG1DBR3_SIZE                              0x1
#define _CWG1DBR_CWG1DBR3_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR3_MASK                              0x8
#define _CWG1DBR_CWG1DBR4_POSN                              0x4
#define _CWG1DBR_CWG1DBR4_POSITION                          0x4
#define _CWG1DBR_CWG1DBR4_SIZE                              0x1
#define _CWG1DBR_CWG1DBR4_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR4_MASK                              0x10
#define _CWG1DBR_CWG1DBR5_POSN                              0x5
#define _CWG1DBR_CWG1DBR5_POSITION                          0x5
#define _CWG1DBR_CWG1DBR5_SIZE                              0x1
#define _CWG1DBR_CWG1DBR5_LENGTH                            0x1
#define _CWG1DBR_CWG1DBR5_MASK                              0x20

// Register: CWG1DBF
#define CWG1DBF CWG1DBF
extern volatile unsigned char           CWG1DBF             __at(0x60F);
#ifndef _LIB_BUILD
asm("CWG1DBF equ 060Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF                    :8;
    };
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned CWG1DBF                :8;
    };
    struct {
        unsigned CWG1DBF0               :1;
        unsigned CWG1DBF1               :1;
        unsigned CWG1DBF2               :1;
        unsigned CWG1DBF3               :1;
        unsigned CWG1DBF4               :1;
        unsigned CWG1DBF5               :1;
    };
} CWG1DBFbits_t;
extern volatile CWG1DBFbits_t CWG1DBFbits __at(0x60F);
// bitfield macros
#define _CWG1DBF_DBF_POSN                                   0x0
#define _CWG1DBF_DBF_POSITION                               0x0
#define _CWG1DBF_DBF_SIZE                                   0x8
#define _CWG1DBF_DBF_LENGTH                                 0x8
#define _CWG1DBF_DBF_MASK                                   0xFF
#define _CWG1DBF_DBF0_POSN                                  0x0
#define _CWG1DBF_DBF0_POSITION                              0x0
#define _CWG1DBF_DBF0_SIZE                                  0x1
#define _CWG1DBF_DBF0_LENGTH                                0x1
#define _CWG1DBF_DBF0_MASK                                  0x1
#define _CWG1DBF_DBF1_POSN                                  0x1
#define _CWG1DBF_DBF1_POSITION                              0x1
#define _CWG1DBF_DBF1_SIZE                                  0x1
#define _CWG1DBF_DBF1_LENGTH                                0x1
#define _CWG1DBF_DBF1_MASK                                  0x2
#define _CWG1DBF_DBF2_POSN                                  0x2
#define _CWG1DBF_DBF2_POSITION                              0x2
#define _CWG1DBF_DBF2_SIZE                                  0x1
#define _CWG1DBF_DBF2_LENGTH                                0x1
#define _CWG1DBF_DBF2_MASK                                  0x4
#define _CWG1DBF_DBF3_POSN                                  0x3
#define _CWG1DBF_DBF3_POSITION                              0x3
#define _CWG1DBF_DBF3_SIZE                                  0x1
#define _CWG1DBF_DBF3_LENGTH                                0x1
#define _CWG1DBF_DBF3_MASK                                  0x8
#define _CWG1DBF_DBF4_POSN                                  0x4
#define _CWG1DBF_DBF4_POSITION                              0x4
#define _CWG1DBF_DBF4_SIZE                                  0x1
#define _CWG1DBF_DBF4_LENGTH                                0x1
#define _CWG1DBF_DBF4_MASK                                  0x10
#define _CWG1DBF_DBF5_POSN                                  0x5
#define _CWG1DBF_DBF5_POSITION                              0x5
#define _CWG1DBF_DBF5_SIZE                                  0x1
#define _CWG1DBF_DBF5_LENGTH                                0x1
#define _CWG1DBF_DBF5_MASK                                  0x20
#define _CWG1DBF_CWG1DBF_POSN                               0x0
#define _CWG1DBF_CWG1DBF_POSITION                           0x0
#define _CWG1DBF_CWG1DBF_SIZE                               0x8
#define _CWG1DBF_CWG1DBF_LENGTH                             0x8
#define _CWG1DBF_CWG1DBF_MASK                               0xFF
#define _CWG1DBF_CWG1DBF0_POSN                              0x0
#define _CWG1DBF_CWG1DBF0_POSITION                          0x0
#define _CWG1DBF_CWG1DBF0_SIZE                              0x1
#define _CWG1DBF_CWG1DBF0_LENGTH                            0x1
#define _CWG1DBF_CWG1DBF0_MASK                              0x1
#define _CWG1DBF_CWG1DBF1_POSN                              0x1
#define _CWG1DBF_CWG1DBF1_POSITION                          0x1
#define _CWG1DBF_CWG1DBF1_SIZE                              0x1
#define _CWG1DBF_CWG1DBF1_LENGTH                            0x1
#define _CWG1DBF_CWG1DBF1_MASK                              0x2
#define _CWG1DBF_CWG1DBF2_POSN                              0x2
#define _CWG1DBF_CWG1DBF2_POSITION                          0x2
#define _CWG1DBF_CWG1DBF2_SIZE                              0x1
#define _CWG1DBF_CWG1DBF2_LENGTH                            0x1
#define _CWG1DBF_CWG1DBF2_MASK                              0x4
#define _CWG1DBF_CWG1DBF3_POSN                              0x3
#define _CWG1DBF_CWG1DBF3_POSITION                          0x3
#define _CWG1DBF_CWG1DBF3_SIZE                              0x1
#define _CWG1DBF_CWG1DBF3_LENGTH                            0x1
#define _CWG1DBF_CWG1DBF3_MASK                              0x8
#define _CWG1DBF_CWG1DBF4_POSN                              0x4
#define _CWG1DBF_CWG1DBF4_POSITION                          0x4
#define _CWG1DBF_CWG1DBF4_SIZE                              0x1
#define _CWG1DBF_CWG1DBF4_LENGTH                            0x1
#define _CWG1DBF_CWG1DBF4_MASK                              0x10
#define _CWG1DBF_CWG1DBF5_POSN                              0x5
#define _CWG1DBF_CWG1DBF5_POSITION                          0x5
#define _CWG1DBF_CWG1DBF5_SIZE                              0x1
#define _CWG1DBF_CWG1DBF5_LENGTH                            0x1
#define _CWG1DBF_CWG1DBF5_MASK                              0x20

